tests/artillery.yaml
config:
  target: 'https://cb4feb04fa32.ngrok.io'
  phases:
    - duration: 5
      arrivalRate: 1
scenarios:
  - engine: 'socketio'
    flow:
      - emit:
          channel: 'closeRoom'
          data: '{"room":"Me", "message":"test","sentTime":"2020-09-29"}'
          acknowledge:
            json: '$.message'
            value: 'Well done, Me. See you tomorrow?'
    #  - think: 10 # do nothing for 10m and disconnect